----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  main_02
       log:  /Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_02/main_02.log
  log type:  text
 opened on:  13 Jan 2018, 16:17:16

. 
. 
. use "Dataset_2.dta", clear

. 
. ******************************************************************************************************************************
. **** This script creates the preliminary variables I need for the analysis; then saves a NEW dataset: "Dataset_3"
. ******************************************************************************************************************************
. 
. 
. ** Create variable which indicates whether an individual has AT LEAST one child younger than 18; note: cannot assess the exact number of children younger than 18.
. gen child_18 = 0, before(relate)

. replace child = 1 if  yngch < 18
(7,956,016 real changes made)

. drop yngch

. 
. 
. **** Create a dummy for labor status transitions. Explanation in the STATA_book
. 
. * Create a dummy to identify workers in either: PA (federal, state, local), agricolture. (the category "armed force" will be handled directly from the variable "empstat")
. 
. gen agr_pa=0, before(cpsidp_sp)

. replace agr_pa=1 if ind1950==105 | ind1950==916 | ind1950==926 |  ind1950==936
(1,264,488 real changes made)

. 
. 
. **** Dummy for transition: yesterday --> today
. gen tran=0, before(cpsidp_sp)

. 
. ** U-->E
. replace tran=1 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 & ( empstat[_n]==10 | empstat[_n]==12 ) &  ( empstat[_n-1]==21 | empstat[_n-1]==22 ) & agr_pa[_n] != 1
(143,618 real changes made)

. 
. ** E-->U 
. replace tran=2 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 & ( empstat[_n-1]==10 | empstat[_n-1]==12 ) &  ( empstat[_n]==21 | empstat[_n]==22 ) & agr_pa[_n-1] != 1
(128,357 real changes made)

. 
. ** E-->E
. replace tran=3 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 & ( empstat[_n-1]==10 | empstat[_n-1]==12 ) &  ( empstat[_n]==10 | empstat[_n]==12 ) & agr_pa[_n-1] != 1  &  agr_pa[_n] != 1
(10,009,085 real changes made)

. 
. ** N-->E
. replace tran=4 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 &   labforce[_n-1]==01 &  ( empstat[_n]==10 | empstat[_n]==12 )  & agr_pa[_n] != 1
(204,903 real changes made)

. 
. ** E-->N
. replace tran=5 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 &   labforce[_n]==01 &  ( empstat[_n-1]==10 | empstat[_n-1]==12 )  & agr_pa[_n-1] != 1
(237,032 real changes made)

. 
. ** U-->N
. replace tran=6 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 &   labforce[_n]==01 &  ( empstat[_n-1]==21 | empstat[_n-1]==22 )
(130,544 real changes made)

. 
. ** N-->U
. replace tran=7 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 &   labforce[_n-1]==01 &  ( empstat[_n]==21 | empstat[_n]==22 )
(125,452 real changes made)

. 
. ** U-->U
. replace tran=8 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 & ( empstat[_n-1]==21 | empstat[_n-1]==22 ) &  ( empstat[_n]==21 | empstat[_n]==22 )
(338,600 real changes made)

. 
. ** N-->N
. replace tran=9 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 &   labforce[_n-1]==01 &  labforce[_n]==01
(3,105,222 real changes made)

. 
. 
. **** Dummy for transition: today --> tomorrow
. gen tran1 = tran[_n+1]
(1 missing value generated)

. order tran1,after(tran)

. 
. 
. ** Define the value labels
. label define flows 0 "." 1 "UE" 2 "EU" 3 "EE" 4 "NE" 5 "EN" 6 "UN" 7 "NU" 8 "UU" 9 "NN"

. label values tran flows

. label values tran1 flows

. 
. 
. 
. 
. **** Create dummy for occupational switching
. 
. * yesterday --> today
. gen switch=0, after(occ1950)

. replace switch=1 if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5 & occ1950[_n] != occ1950[_n-1] & occ1950[_n] != 999 & occ1950[_n-1] != 999
(612,458 real changes made)

. 
. * today --> tomorrow
. gen switch1 = switch[_n+1], after(switch)
(1 missing value generated)

. 
. 
. **** Create unemployment duration in previous period
. gen durunemp_pre = ., after(durunemp)
(21,751,206 missing values generated)

. replace durunemp_pre = durunemp[_n-1] if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5
(15,410,602 real changes made)

. 
. 
. 
. 
. **** Create broad category of industry and occupation
. 
. ** In ipums armed forces are coded together with unemployed for the occupation and NIU in industry, I change that:
. 
. replace occ1950 = 980 if empstat == 01
(114,875 real changes made)

. replace ind1950 = 980 if empstat == 01
(114,875 real changes made)

. 
. *** Occupation
. 
. gen occ1950_broad = ., after(occ1950)   
(21,751,206 missing values generated)

.         
. replace occ1950_broad = 1 if (occ1950 >= 000 & occ1950 <= 010)          /* Professional, Technical */
(383,802 real changes made)

. replace occ1950_broad = 2 if (occ1950 >= 012 & occ1950 <= 099)          /* Professors and instructors */
(3,700,895 real changes made)

. replace occ1950_broad = 3 if (occ1950 >= 100 & occ1950 <= 123)          /* Farmers */
(149,921 real changes made)

. replace occ1950_broad = 4 if (occ1950 >= 200 & occ1950 <= 290)          /* Managers, Officials, and Proprietors */
(2,389,276 real changes made)

. replace occ1950_broad = 5 if (occ1950 >= 300 & occ1950 <= 390)          /* Clerical and Kindred */
(2,748,111 real changes made)

. replace occ1950_broad = 6 if (occ1950 >= 400 & occ1950 <= 490)          /* Sales workers */
(993,528 real changes made)

. replace occ1950_broad = 7 if (occ1950 >= 500 & occ1950 <= 595)          /* Craftsmen */
(1,664,407 real changes made)

. replace occ1950_broad = 8 if (occ1950 >= 600 & occ1950 <= 690)          /* Operatives */
(1,643,429 real changes made)

. replace occ1950_broad = 9 if (occ1950 >= 700 & occ1950 <= 790)          /* Service Workers */
(2,370,739 real changes made)

. replace occ1950_broad = 10 if (occ1950 >= 810 & occ1950 <= 840)         /* Farm Laborers */
(98,702 real changes made)

. replace occ1950_broad = 11 if (occ1950 >= 910 & occ1950 <= 970)         /* Laborers */
(682,915 real changes made)

. replace occ1950_broad = 12 if occ1950 == 980    /* Armed Forces */
(114,875 real changes made)

. replace occ1950_broad = 997 if occ1950 == 997   /*Not reported/unknown*/
(0 real changes made)

. replace occ1950_broad = 999 if occ1950 == 999   /*NIU, no occupation*/
(4,810,606 real changes made)

.         
. 
. ** Define the value labels
. label define occ  1 "Professional, Technical" 2 "Professors and instructors" 3 "Farmers" 4 "Managers, Officials, and Proprietors" 5 "Clerical and Kindred" 6 "Sales workers" 7 "Craftsmen" 8 "Operatives" 9 "Service
>  Workers" 10 "Farm Laborers" 11 "Laborers" 12 "Armed Forces" 997 "Not reported/unknown" 999 "Unemployed- last worked over x years ag"            

. label values occ1950_broad occ

. 
. ** Create broad occupation in previous period
. gen occ1950_broad_pre = ., after(occ1950_broad)
(21,751,206 missing values generated)

. replace occ1950_broad_pre = occ1950_broad[_n-1] if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5
(15,410,602 real changes made)

. label values occ1950_broad_pre occ

.         
.         
. *** Industry
. 
. gen ind1950_broad = ., after(ind1950)
(21,751,206 missing values generated)

. 
. replace ind1950_broad = 0 if ind1950 == 000                       /*NIU*/
(4,811,298 real changes made)

. replace ind1950_broad = 1 if (ind1950 >= 105 & ind1950 <= 126)    /*AGRICULTURE, FORESTRY, AND FISHERIES*/
(462,228 real changes made)

. replace ind1950_broad = 2 if (ind1950 >= 206 & ind1950 <= 236)    /*MINING*/
(115,806 real changes made)

. replace ind1950_broad = 3 if ind1950 == 246                       /*CONSTRUCTION*/
(1,221,843 real changes made)

. replace ind1950_broad = 4 if (ind1950 >= 306 & ind1950 <= 499)    /*MANUFACTURING*/
(2,119,197 real changes made)

. replace ind1950_broad = 5 if (ind1950 >= 506 & ind1950 <= 598)    /*TRANSPORTATION, COMMUNICATIONS, AND OTHER PUBLIC UTILITIES*/
(885,014 real changes made)

. replace ind1950_broad = 6 if (ind1950 >= 606 & ind1950 <= 627)    /*WHOLESALE TRADE. Note: here Javier keeps separated the two subcategoires, and so do I. According to the criterion I follow for the categories, W
> holesale trade and Retail trade should go together*/ 
(508,495 real changes made)

. replace ind1950_broad = 7 if (ind1950 >= 636 & ind1950 <= 699)    /*RETAIL TRADE*/
(2,769,760 real changes made)

. replace ind1950_broad = 8 if (ind1950 >= 716 & ind1950 <= 746)    /*FINANCE, INSURANCE, AND REAL ESTATE*/
(1,089,329 real changes made)

. replace ind1950_broad = 9 if (ind1950 >= 806 & ind1950 <= 817)    /*BUSINESS AND REPAIR SERVICES*/
(1,281,867 real changes made)

. replace ind1950_broad = 10 if (ind1950 >= 826 & ind1950 <= 849)   /*PERSONAL SERVICES*/
(554,972 real changes made)

. replace ind1950_broad = 11 if (ind1950 >= 856 & ind1950 <= 859)   /*ENTERTAINMENT AND RECREATION SERVICES*/
(405,733 real changes made)

. replace ind1950_broad = 12 if (ind1950 >= 868 & ind1950 <= 899)   /*PROFESSIONAL AND RELATED SERVICES*/
(4,485,012 real changes made)

. replace ind1950_broad = 13 if (ind1950 >= 906 & ind1950 <= 936)   /*PUBLIC ADMINISTRATION*/
(925,777 real changes made)

. replace ind1950_broad = 14 if ind1950 == 980                      /*ARMED FORCES */
(114,875 real changes made)

. 
. 
. ** Define the value labels
. label define ind 0 "NIU" 1 "AGRICULTURE, FORESTRY, AND FISHERIES" 2 "MINING" 3 "CONSTRUCTION" 4 "MANUFACTURING" 5 "TRANSPORTATION, COMMUNICATIONS, AND OTHER PUBLIC UTILITIES" 6 "WHOLESALE TRADE" 7 "RETAIL TRADE" 
> 8 "FINANCE, INSURANCE, AND REAL ESTATE" 9 "BUSINESS AND REPAIR SERVICES" 10 "PERSONAL SERVICES" 11 "ENTERTAINMENT AND RECREATION SERVICES" 12 "PROFESSIONAL AND RELATED SERVICES" 13 "PUBLIC ADMINISTRATION" 14 "Arm
> ed Forces"            

. label values ind1950_broad ind

. 
. 
. ** Create broad industry in previous period
. gen ind1950_broad_pre = ., after(ind1950_broad)
(21,751,206 missing values generated)

. replace ind1950_broad_pre = ind1950_broad[_n-1] if cpsidp[_n]==cpsidp[_n-1] & mish[_n]==mish[_n-1]+1 & mish[_n] != 5
(15,410,602 real changes made)

. label values ind1950_broad_pre ind

. 
. 
. 
. **** Create broad category of race
. 
. gen race_broad =., after(race)
(21,751,206 missing values generated)

. 
. replace race_broad = 0 if race == 100
(18,072,250 real changes made)

. replace race_broad = 1 if race != 100 
(3,678,956 real changes made)

. 
. * Define the value labels
. label define race 0 "White" 1 "Non-white" 

. label values race_broad race

. 
. 
. 
. **** Create broad category of education; 
. 
. gen educ_broad =., after(educ)
(21,751,206 missing values generated)

. 
. replace educ_broad = 0 if educ >= 2 & educ <= 71
(2,561,160 real changes made)

. replace educ_broad = 1 if educ == 73
(6,770,061 real changes made)

. replace educ_broad = 2 if educ == 81
(4,380,985 real changes made)

. replace educ_broad = 3 if educ >= 91 & educ <= 111
(6,032,487 real changes made)

. replace educ_broad = 4 if educ >= 123 & educ <= 125
(2,006,513 real changes made)

. 
. * Define the value labels
. label define educ 0 "No highschool diploma" 1 "Highschool diploma" 2 "Some college but not degree" 3 "Associate or Bachelor degree" 4 "More than Associate or Bachelor degree" 

. label values educ_broad educ

. 
. 
. 
. 
. **** Create real wages: 
. 
. * Hour
. gen rhourwage = (hourwage / cpi) * 100, after(hourwage)

. label var rhourwage "reale hour wage"

. * Week
. gen rearnweek = (earnweek / cpi) * 100, after(earnweek)

. label var rearnweek "reale weekly wage"

. 
. * Drop cpi
. drop cpi

. 
. 
. 
. 
. 
. cd "$directory/Selection_03"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_03

. save "Dataset_3.dta", replace
file Dataset_3.dta saved

. 
. 
. cd "$directory/Selection_02"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_02

. log close main_02
      name:  main_02
       log:  /Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_02/main_02.log
  log type:  text
 closed on:  13 Jan 2018, 16:19:13
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
