----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  main_09_w_regr
       log:  /Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_09/main_09_w_regr.log
  log type:  text
 opened on:  13 Jan 2018, 16:58:04

. 
. 
. 
. use "Earner_study.dta", clear

. 
. 
. ******************************************************************************************************************************
. *** Weekly wage, couple study; probit regression, cox hazard estimation
. ******************************************************************************************************************************
. 
. 
. 
. ******************************************************************************************************************************
. *** Initial operations: 
. ******************************************************************************************************************************
. 
. * Keep only hourly wage
. drop rhourwage hourwage rhourwage_sp hourwage_sp

. 
. * Drop reference's wage, I just the partner's wage
. drop earnweek rearnweek

. 
. * Drop employed with zero wage; for the regression analysis, I care only about partner's wage.
. drop if earnweek_sp == 0 & ( empstat_sp == 10 | empstat_sp == 12 )
(4,068 observations deleted)

. 
. 
. * Of those employed and paid by hour, somebody doesn't report the wage (132)
. drop if earnweek_sp == 99.99  & ( empstat_sp == 10 | empstat_sp == 12 ) 
(1 observation deleted)

. 
. 
. * Trim implausible weekly wage:
. drop if rearnweek_sp>2000 
(0 observations deleted)

. drop if rearnweek_sp>0 & rearnweek_sp<50   
(28,776 observations deleted)

. 
. 
. 
. 
. ** Use log wages
. gen log_wage_sp= ln(rearnweek_sp + 1), after(rearnweek_sp)

. 
. 
. ****************************************************************************************************************************** 
. *** PROBIT REGRESSIONS
. ******************************************************************************************************************************
. 
. 
. sort cpsidp year month

. 
. 
. *** Generate the variables
. 
. ** Transit from Unemp. to Emp. (UE)
. gen tran_org = ., after(tran1)
(2,568,980 missing values generated)

. replace tran_org = 0 if ( tran == 1 | tran == 6 | tran == 8 ) // Unemployed at previous period
(66,374 real changes made)

. replace tran_org = 1 if tran == 1 // Employed in "Current"
(16,394 real changes made)

. label var tran_org "U-->E"

. 
. 
. 
. ** Create quintiles
. egen q_wage_sp = xtile(log_wage_sp) if empstat_sp == 10 | empstat_sp == 12, w(earnwt) n(5)
(653220 missing values generated)

. order q_wage_sp, after(log_wage_sp)

. 
. 
. 
. ** Generate dummies for the 6 categories I need:
. 
. * UN
. gen UN_ind_sp = 0, after(q_wage_sp)

. replace UN_ind_sp = 1 if empstat_sp != 10 & empstat_sp != 12
(653,220 real changes made)

. * Q1
. gen q1_ind_sp = 0, after(UN_ind_sp)

. replace q1_ind_sp = 1 if q_wage_sp == 1
(375,517 real changes made)

. * Q2
. gen q2_ind_sp = 0, after(q1_ind_sp)

. replace q2_ind_sp = 1 if q_wage_sp == 2
(385,783 real changes made)

. * Q3
. gen q3_ind_sp = 0, after(q2_ind_sp)

. replace q3_ind_sp = 1 if q_wage_sp == 3
(389,198 real changes made)

. * Q4
. gen q4_ind_sp = 0, after(q3_ind_sp)

. replace q4_ind_sp = 1 if q_wage_sp == 4
(388,702 real changes made)

. * Q5
. gen q5_ind_sp = 0, after(q4_ind_sp)

. replace q5_ind_sp = 1 if q_wage_sp == 5
(376,560 real changes made)

. 
. 
. ** Get the unemployemnt rate from Dataset_3.dta, then take the log:
. cd "$directory/Selection_04"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_04

. merge m:1 year month using "Dataset_4.dta"
(label month_lbl already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        20,535
        from master                    20,535  (_merge==1)
        from using                          0  (_merge==2)

    matched                         2,548,445  (_merge==3)
    -----------------------------------------

. drop EE_mr EU_mr EN_mr UE_mr UU_mr UN_mr NE_mr NU_mr NN_mr EE_mr_f EU_mr_f EN_mr_f UE_mr_f UU_mr_f UN_mr_f NE_mr_f NU_mr_f NN_mr_f EE_mr_m EU_mr_m EN_mr_m UE_mr_m UU_mr_m UN_mr_m NE_mr_m NU_mr_m NN_mr_m

. drop _merge

. 
. gen log_unEmp = log(UnEmp_rate + 1)
(20,535 missing values generated)

. 
. 
. ** generate the time variable
. gen time=ym(year ,month), after(month)

. 
. ** Polynomial of age
. gen age2 = age^2

. 
. 
. 
. 
. *** UE Probit regression; omit one dummy to avoid collinearity; 
. set matsize 700

. 
. qui probit tran_org age age2  time durunemp_pre UnEmp_rate  child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp i.time i.educ_broad i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i
> .statefip [pweight = earnwt] 

. estimates table, drop(i.time i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.statefip) star // this is manly done to suppres all the coefficient on i.time etc. (see h estimates table for details)

------------------------------
    Variable |    active      
-------------+----------------
         age | -.00463369     
        age2 | -3.757e-06     
        time | -.00198644     
durunemp_pre | -.01016419***  
  UnEmp_rate | -35.229906     
    child_18 |  .03611081*    
  race_broad | -.08364824***  
   UN_ind_sp |  .01914092     
   q1_ind_sp |  .01864185     
   q2_ind_sp | -.01360183     
   q3_ind_sp |  .03162346     
   q4_ind_sp | -.00294326     
   q5_ind_sp |  (omitted)     
             |
  educ_broad |
Highschoo..  |  .00053814     
Some coll..  |  .02577781     
Associate..  |  .04097708     
More than..  |  .07766526*    
             |
       _cons |  2.2442529     
------------------------------
legend: * p<0.05; ** p<0.01; *** p<0.001

. 
. cd "$directory/Selection_10/Table"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_10/Table

. outreg2 age age2 log_unEmp time durunemp_pre child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp using prob1_1_w.doc, replace tex ctitle(UE Probit) drop(i.time i.occ1950_broad_pre i.in
> d1950_broad_pre i.hhtenure i.statefip)
prob1_1_w.tex
prob1_1_w.doc
dir : seeout

. cd "$directory/Selection_09"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_09

. 
. 
. 
. 
. 
. ******** Job switching Probit regression; omit one dummy to avoid collinearity; 
. 
. qui probit switch age age2 log_unEmp time durunemp_pre  child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp i.time i.educ_broad i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.sta
> tefip [pweight = earnwt] if tran_org == 1

. estimates table, drop(i.time i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.statefip) star // this is manly done to suppres all the coefficient on i.time etc. (see h estimates table" for details)

------------------------------
    Variable |    active      
-------------+----------------
         age | -.03358221***  
        age2 |  .00026824**   
   log_unEmp | -44.150502     
        time | -.00403629     
durunemp_pre |  .00722075***  
    child_18 | -.03588293     
  race_broad |  .03602737     
   UN_ind_sp |  .12569117**   
   q1_ind_sp |  .14408824**   
   q2_ind_sp |  .13049176**   
   q3_ind_sp |  .16322825***  
   q4_ind_sp |  .10570938*    
   q5_ind_sp |  (omitted)     
             |
  educ_broad |
Highschoo..  |  .06685573     
Some coll..  |  .14152955**   
Associate..  |  .11286063**   
More than..  |  .03099726     
             |
       _cons |   5.986714     
------------------------------
legend: * p<0.05; ** p<0.01; *** p<0.001

. 
. cd "$directory/Selection_10/Table"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_10/Table

. outreg2 age age2 log_unEmp time durunemp_pre child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp using prob1_2_w.doc, replace tex ctitle(Occ switch) drop(i.time i.educ i.occ1950_broad_
> pre i.ind1950_broad_pre i.hhtenure i.statefip)
prob1_2_w.tex
prob1_2_w.doc
dir : seeout

. cd "$directory/Selection_09"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_09

. 
. 
. 
. 
. ****************************************************************************************************************************** 
. *** COX REGRESSION
. ******************************************************************************************************************************
. 
. ******** UE Cox, hazard model
. 
. drop if tran_org == . 
(2,502,606 observations deleted)

. 
. stset durunemp_pre [pweight = earnwt] , failure(tran_org == 1)

     failure event:  tran_org == 1
obs. time interval:  (0, durunemp_pre]
 exit on or before:  failure
            weight:  [pweight=earnwt]

------------------------------------------------------------------------------
      66374  total observations
        151  observations end on or before enter()
------------------------------------------------------------------------------
      66223  observations remaining, representing
      16332  failures in single-record/single-failure data
    1562998  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       119

. 
. qui stcox age age2 log_unEmp time child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp i.time i.educ_broad i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.statefip, nohr 

. estimates table, drop(i.time i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.statefip) star // this is manly done to suppres all the coefficient on i.time etc. (see h estimates table" for details)

------------------------------
    Variable |    active      
-------------+----------------
         age |  -.0318967***  
        age2 |  .00016886*    
   log_unEmp |          0     
        time |  .00030315     
    child_18 |  .07991162***  
  race_broad | -.25802072***  
   UN_ind_sp | -.04888281     
   q1_ind_sp | -.05680012     
   q2_ind_sp | -.08652483*    
   q3_ind_sp |   .0036462     
   q4_ind_sp | -.01623131     
   q5_ind_sp |  (omitted)     
             |
  educ_broad |
Highschoo..  |  .02335864     
Some coll..  |  .06472841*    
Associate..  |  .10580049**   
More than..  |  .13268414**   
------------------------------
legend: * p<0.05; ** p<0.01; *** p<0.001

. 
. cd "$directory/Selection_10/Table"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_10/Table

. outreg2 age age2 log_unEmp time child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp using probH_1_w.doc, replace tex ctitle(Hazard UE) drop(i.time i.educ i.occ1950_broad_pre i.ind1950_
> broad_pre i.hhtenure i.statefip)
probH_1_w.tex
probH_1_w.doc
dir : seeout

. cd "$directory/Selection_09"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_09

. 
. 
. 
. ******** Job switch, Cox hazard model
. 
. stset durunemp_pre [pweight = earnwt] , failure(switch == 1)

     failure event:  switch == 1
obs. time interval:  (0, durunemp_pre]
 exit on or before:  failure
            weight:  [pweight=earnwt]

------------------------------------------------------------------------------
      66374  total observations
        151  observations end on or before enter()
------------------------------------------------------------------------------
      66223  observations remaining, representing
      11111  failures in single-record/single-failure data
    1562998  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       119

. 
. qui stcox age age2 log_unEmp time child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp i.time i.educ_broad i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.statefip if tran_org == 1
> , nohr 

. estimates table, drop(i.time i.occ1950_broad_pre i.ind1950_broad_pre i.hhtenure i.statefip) star // this is manly done to suppres all the coefficient on i.time etc. (see h estimates table" for details)

------------------------------
    Variable |    active      
-------------+----------------
         age | -.04792806***  
        age2 |  .00039246***  
   log_unEmp | -72.305353     
        time | -.00579856     
    child_18 | -.00243414     
  race_broad | -.13061001***  
   UN_ind_sp | -.05906732     
   q1_ind_sp | -.04593353     
   q2_ind_sp |  -.0519139     
   q3_ind_sp |  .01924401     
   q4_ind_sp |  .04115565     
   q5_ind_sp |  (omitted)     
             |
  educ_broad |
Highschoo..  |  .03989966     
Some coll..  |  .10467767*    
Associate..  |  .10938183*    
More than..  |  .04421358     
------------------------------
legend: * p<0.05; ** p<0.01; *** p<0.001

. 
. cd "$directory/Selection_10/Table"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_10/Table

. outreg2 age age2 log_unEmp time child_18 race_broad UN_ind_sp q1_ind_sp q2_ind_sp q3_ind_sp q4_ind_sp q5_ind_sp using probH_2_w.doc, replace tex ctitle(Hazard Occ Switch) drop(i.time i.educ i.occ1950_broad_pre i.
> ind1950_broad_pre i.hhtenure i.statefip)
probH_2_w.tex
probH_2_w.doc
dir : seeout

. cd "$directory/Selection_09"
/Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_09

. 
. 
. log close main_09_w_regr
      name:  main_09_w_regr
       log:  /Users/tommaso/Desktop/RAship_Javier/IPUMS/Selection_09/main_09_w_regr.log
  log type:  text
 closed on:  13 Jan 2018, 17:24:16
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
